package com.amarsoft.app.lending.bizlets;
/**
 * 五级分类模型计算
 * @author zrli
 	01		正常
	0101	正常1
	0102	正常2
	0103	正常3
	02		关注
	0201	关注1
	0202	关注2
	0203	关注3
	03		次级
	0301	次级1
	0302	次级2
	04		可疑
	0400	可疑
	05		损失
	0500	损失
 */
public class ClassifyModel {
	//小企业十级低风险 逾期与对应级别
	public static final String[][] M1 ={{"0","0101"},
										{"30","0103"},
										{"90","0103"},
										{"180","0203"},
										{"360","0302"},
										{"999","0302"}
										};
	//小企业十级非低风险担保、逾期天数矩阵
	public static final String[][] M2 ={{"005","0","0103"},
										{"005","30","0201"},
										{"005","90","0301"},
										{"005","180","0400"},
										{"005","360","0400"},
										{"005","999","0500"},
										{"010","0","0103"},
										{"010","30","0103"},
										{"010","90","0202"},
										{"010","180","0301"},
										{"010","360","0400"},
										{"010","999","0500"},
										{"020","0","0102"},
										{"020","30","0103"},
										{"020","90","0202"},
										{"020","180","0203"},
										{"020","360","0302"},
										{"020","999","0400"},
										{"040","0","0102"},
										{"040","30","0103"},
										{"040","90","0202"},
										{"040","180","0203"},
										{"040","360","0302"},
										{"040","999","0400"}
										};	
	//一般企业十级低风险逾期矩阵
	public static final String[][] M5 ={{"0","0101"},
										{"30","0103"},
										{"90","0103"},
										{"180","0203"},
										{"360","0302"},
										{"999","0302"}
										};
	//一般企业十级非低风险逾期天数分类矩阵 这里是最高分类结果
	public static final String[][] M6 ={{"0","0101"},
										{"30","0202"},
										{"90","0203"},
										{"180","0302"},
										{"999","0400"}
										};
	

	//一般企业十级非低风险信用等级、担保方式分类矩阵 这里是最高分类结果
	public static final String[][] M9 ={{"AAA","005","0101"},//信用
										{"AA","005","0101"},//信用
										{"A","005","0102"},//信用
										{"BBB","005","0103"},//信用
										{"BB","005","0201"},//信用
										{"B","005","0202"},//信用
										{"","005","0103"},//信用
										
										{"AAA","0105010","0101"},//企业保证-AAA级
										{"AAA","0105070","0101"},//企业保证-我国中央政府投资的公用企业
										{"AAA","0101010","0101"},//保证-中、农、工、建、交及国家政策性银行
										{"AAA","0101020","0101"},//保证-股份制商业银行
										{"AA","0105010","0101"},//企业保证-AAA级
										{"AA","0105070","0101"},//企业保证-我国中央政府投资的公用企业
										{"AA","0101010","0101"},//保证-中、农、工、建、交及国家政策性银行
										{"AA","0101020","0101"},//保证-股份制商业银行
										{"A","0105010","0101"},//企业保证-AAA级
										{"A","0105070","0101"},//企业保证-我国中央政府投资的公用企业
										{"A","0101010","0101"},//保证-中、农、工、建、交及国家政策性银行
										{"A","0101020","0101"},//保证-股份制商业银行
										{"BBB","0105010","0101"},//企业保证-AAA级
										{"BBB","0105070","0101"},//企业保证-我国中央政府投资的公用企业
										{"BBB","0101010","0101"},//保证-中、农、工、建、交及国家政策性银行
										{"BBB","0101020","0101"},//保证-股份制商业银行
										{"BB","0105010","0102"},//企业保证-AAA级
										{"BB","0105070","0102"},//企业保证-我国中央政府投资的公用企业
										{"BB","0101010","0102"},//保证-中、农、工、建、交及国家政策性银行
										{"BB","0101020","0102"},//保证-股份制商业银行
										{"B","0105010","0201"},//企业保证-AAA级
										{"B","0105070","0201"},//企业保证-我国中央政府投资的公用企业
										{"B","0101010","0201"},//保证-中、农、工、建、交及国家政策性银行
										{"B","0101020","0201"},//保证-股份制商业银行
										{"","0105010","0101"},//企业保证-AAA级
										{"","0105070","0101"},//企业保证-我国中央政府投资的公用企业
										{"","0101010","0101"},//保证-中、农、工、建、交及国家政策性银行
										{"","0101020","0101"},//保证-股份制商业银行
										
										{"AAA","0105020","0101"},//企业保证-AA级
										{"AAA","0101030","0101"},//保证-天津银行
										{"AAA","0101040","0101"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"AAA","0101050","0101"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"AAA","0101060","0101"},//保证-备用信用证
										{"AAA","0102010","0101"},//保证-保险公司履约保险
										{"AAA","0102020","0101"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"AAA","0102030","0101"},//保证- 出口信用保险
										{"AAA","0103010","0101"},//担保公司保证-AAA级
										{"AAA","0104010","0101"},//保证-市级财政
										{"AA","0105020","0101"},//企业保证-AA级
										{"AA","0101030","0101"},//保证-天津银行
										{"AA","0101040","0101"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"AA","0101050","0101"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"AA","0101060","0101"},//保证-备用信用证
										{"AA","0102010","0101"},//保证-保险公司履约保险
										{"AA","0102020","0101"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"AA","0102030","0101"},//保证- 出口信用保险
										{"AA","0103010","0101"},//担保公司保证-AAA级
										{"AA","0104010","0101"},//保证-市级财政
										{"A","0105020","0101"},//企业保证-AA级
										{"A","0101030","0101"},//保证-天津银行
										{"A","0101040","0101"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"A","0101050","0101"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"A","0101060","0101"},//保证-备用信用证
										{"A","0102010","0101"},//保证-保险公司履约保险
										{"A","0102020","0101"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"A","0102030","0101"},//保证- 出口信用保险
										{"A","0103010","0101"},//担保公司保证-AAA级
										{"A","0104010","0101"},//保证-市级财政
										{"BBB","0105020","0102"},//企业保证-AA级
										{"BBB","0101030","0102"},//保证-天津银行
										{"BBB","0101040","0102"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"BBB","0101050","0102"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"BBB","0101060","0102"},//保证-备用信用证
										{"BBB","0102010","0102"},//保证-保险公司履约保险
										{"BBB","0102020","0102"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"BBB","0102030","0102"},//保证- 出口信用保险
										{"BBB","0103010","0102"},//担保公司保证-AAA级
										{"BBB","0104010","0102"},//保证-市级财政
										{"BB","0105020","0201"},//企业保证-AA级
										{"BB","0101030","0201"},//保证-天津银行
										{"BB","0101040","0201"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"BB","0101050","0201"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"BB","0101060","0201"},//保证-备用信用证
										{"BB","0102010","0201"},//保证-保险公司履约保险
										{"BB","0102020","0201"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"BB","0102030","0201"},//保证- 出口信用保险
										{"BB","0103010","0201"},//担保公司保证-AAA级
										{"BB","0104010","0201"},//保证-市级财政
										{"B","0105020","0202"},//企业保证-AA级
										{"B","0101030","0202"},//保证-天津银行
										{"B","0101040","0202"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"B","0101050","0202"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"B","0101060","0202"},//保证-备用信用证
										{"B","0102010","0202"},//保证-保险公司履约保险
										{"B","0102020","0202"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"B","0102030","0202"},//保证- 出口信用保险
										{"B","0103010","0202"},//担保公司保证-AAA级
										{"B","0104010","0202"},//保证-市级财政
										{"","0105020","0102"},//企业保证-AA级
										{"","0101030","0102"},//保证-天津银行
										{"","0101040","0102"},//保证-我行给予担保授信额度的银行及信用社（法人）
										{"","0101050","0102"},//保证-国外代理银行（票据包买、出口贴现、出口押汇）
										{"","0101060","0102"},//保证-备用信用证
										{"","0102010","0102"},//保证-保险公司履约保险
										{"","0102020","0102"},//保证-我行给予担保授信额度的其他非银行金融机构
										{"","0102030","0102"},//保证- 出口信用保险
										{"","0103010","0102"},//担保公司保证-AAA级
										{"","0104010","0102"},//保证-市级财政
										
										{"AAA","0105030","0101"},//企业保证-A级
										{"AAA","0103020","0101"},//担保公司保证-AA级
										{"AAA","0104020","0101"},//保证-区县级财政
										{"AA","0105030","0101"},//企业保证-A级
										{"AA","0103020","0101"},//担保公司保证-AA级
										{"AA","0104020","0101"},//保证-区县级财政
										{"A","0105030","0102"},//企业保证-A级
										{"A","0103020","0102"},//担保公司保证-AA级
										{"A","0104020","0102"},//保证-区县级财政
										{"BBB","0105030","0103"},//企业保证-A级
										{"BBB","0103020","0103"},//担保公司保证-AA级
										{"BBB","0104020","0103"},//保证-区县级财政
										{"BB","0105030","0202"},//企业保证-A级
										{"BB","0103020","0202"},//担保公司保证-AA级
										{"BB","0104020","0202"},//保证-区县级财政
										{"B","0105030","0203"},//企业保证-A级
										{"B","0103020","0203"},//担保公司保证-AA级
										{"B","0104020","0203"},//保证-区县级财政
										{"","0105030","0103"},//企业保证-A级
										{"","0103020","0103"},//担保公司保证-AA级
										{"","0104020","0103"},//保证-区县级财政
										
										{"AAA","0105040","0101"},//企业保证-BBB级
										{"AAA","0103030","0101"},//担保公司保证-A级
										{"AAA","0103040","0101"},//担保公司保证-BBB级
										{"AAA","0104030","0101"},//保证-镇级财政
										{"AAA","0106010","0101"},//自然人保证-AAA级
										{"AAA","0106020","0101"},//自然人保证-AA级
										{"AAA","0106030","0101"},//自然人保证-A级
										{"AAA","0106040","0101"},//自然人保证-BBB级及以下
										{"AAA","01065","0101"},//联保小组互保
										{"AA","0105040","0101"},//企业保证-BBB级
										{"AA","0103030","0101"},//担保公司保证-A级
										{"AA","0103040","0101"},//担保公司保证-BBB级
										{"AA","0104030","0101"},//保证-镇级财政
										{"AA","0106010","0101"},//自然人保证-AAA级
										{"AA","0106020","0101"},//自然人保证-AA级
										{"AA","0106030","0101"},//自然人保证-A级
										{"AA","0106040","0101"},//自然人保证-BBB级及以下
										{"AA","01065","0101"},//联保小组互保
										{"A","0105040","0102"},//企业保证-BBB级
										{"A","0103030","0102"},//担保公司保证-A级
										{"A","0103040","0102"},//担保公司保证-BBB级
										{"A","0104030","0102"},//保证-镇级财政
										{"A","0106010","0102"},//自然人保证-AAA级
										{"A","0106020","0102"},//自然人保证-AA级
										{"A","0106030","0102"},//自然人保证-A级
										{"A","0106040","0102"},//自然人保证-BBB级及以下
										{"A","01065","0102"},//联保小组互保
										{"BBB","0105040","0201"},//企业保证-BBB级
										{"BBB","0103030","0201"},//担保公司保证-A级
										{"BBB","0103040","0201"},//担保公司保证-BBB级
										{"BBB","0104030","0201"},//保证-镇级财政
										{"BBB","0106010","0201"},//自然人保证-AAA级
										{"BBB","0106020","0201"},//自然人保证-AA级
										{"BBB","0106030","0201"},//自然人保证-A级
										{"BBB","0106040","0201"},//自然人保证-BBB级及以下
										{"BBB","01065","0201"},//联保小组互保
										{"BB","0105040","0202"},//企业保证-BBB级
										{"BB","0103030","0202"},//担保公司保证-A级
										{"BB","0103040","0202"},//担保公司保证-BBB级
										{"BB","0104030","0202"},//保证-镇级财政
										{"BB","0106010","0202"},//自然人保证-AAA级
										{"BB","0106020","0202"},//自然人保证-AA级
										{"BB","0106030","0202"},//自然人保证-A级
										{"BB","0106040","0202"},//自然人保证-BBB级及以下
										{"BB","01065","0202"},//联保小组互保
										{"B","0105040","0203"},//企业保证-BBB级
										{"B","0103030","0203"},//担保公司保证-A级
										{"B","0103040","0203"},//担保公司保证-BBB级
										{"B","0104030","0203"},//保证-镇级财政
										{"B","0106010","0203"},//自然人保证-AAA级
										{"B","0106020","0203"},//自然人保证-AA级
										{"B","0106030","0203"},//自然人保证-A级
										{"B","0106040","0203"},//自然人保证-BBB级及以下
										{"B","01065","0203"},//联保小组互保
										{"","0105040","0201"},//企业保证-BBB级
										{"","0103030","0201"},//担保公司保证-A级
										{"","0103040","0201"},//担保公司保证-BBB级
										{"","0104030","0201"},//保证-镇级财政
										{"","0106010","0201"},//自然人保证-AAA级
										{"","0106020","0201"},//自然人保证-AA级
										{"","0106030","0201"},//自然人保证-A级
										{"","0106040","0201"},//自然人保证-BBB级及以下
										{"","01065","0201"},//联保小组互保
										
										{"AAA","0105050","0101"},//企业保证-BB级
										{"AAA","0103050","0101"},//担保公司保证-BB级
										{"AAA","0103060","0101"},//担保公司保证-B级
										{"AAA","01070","0101"},//其他保证
										{"AA","0105050","0101"},//企业保证-BB级
										{"AA","0103050","0101"},//担保公司保证-BB级
										{"AA","0103060","0101"},//担保公司保证-B级
										{"AA","01070","0101"},//其他保证
										{"A","0105050","0102"},//企业保证-BB级
										{"A","0103050","0102"},//担保公司保证-BB级
										{"A","0103060","0102"},//担保公司保证-B级
										{"A","01070","0102"},//其他保证
										{"BBB","0105050","0201"},//企业保证-BB级
										{"BBB","0103050","0201"},//担保公司保证-BB级
										{"BBB","0103060","0201"},//担保公司保证-B级
										{"BBB","01070","0201"},//其他保证
										{"BB","0105050","0202"},//企业保证-BB级
										{"BB","0103050","0202"},//担保公司保证-BB级
										{"BB","0103060","0202"},//担保公司保证-B级
										{"BB","01070","0202"},//其他保证
										{"B","0105050","0203"},//企业保证-BB级
										{"B","0103050","0203"},//担保公司保证-BB级
										{"B","0103060","0203"},//担保公司保证-B级
										{"B","01070","0203"},//其他保证
										{"","0105050","0201"},//企业保证-BB级
										{"","0103050","0201"},//担保公司保证-BB级
										{"","0103060","0201"},//担保公司保证-B级
										{"","01070","0201"},//其他保证
										
										{"AAA","0105060","0101"},//企业保证-B级
										{"AA","0105060","0101"},//企业保证-B级
										{"A","0105060","0102"},//企业保证-B级
										{"BBB","0105060","0201"},//企业保证-B级
										{"BB","0105060","0203"},//企业保证-B级
										{"B","0105060","0203"},//企业保证-B级
										{"","0105060","0201"},//企业保证-B级
										
										{"AAA","0201020","0101"},//抵押-商品房（住宅）
										{"AA","0201020","0101"},//抵押-商品房（住宅）
										{"A","0201020","0101"},//抵押-商品房（住宅）
										{"BBB","0201020","0102"},//抵押-商品房（住宅）
										{"BB","0201020","0201"},//抵押-商品房（住宅）
										{"B","0201020","0202"},//抵押-商品房（住宅）
										{"","0201020","0102"},//抵押-商品房（住宅）
										
										{"AAA","0202010","0101"},//抵押-标准厂房（开发区内）
										{"AAA","0203010","0101"},//抵押-国有划拨土地使用权
										{"AAA","0201010","0101"},//抵押-商品房（商用）
										{"AAA","0201030","0101"},//抵押-商品房（办公用）
										{"AAA","0203020","0101"},//抵押-国有出让土地使用权
										{"AA","0202010","0101"},//抵押-标准厂房（开发区内）
										{"AA","0203010","0101"},//抵押-国有划拨土地使用权
										{"AA","0201010","0101"},//抵押-商品房（商用）
										{"AA","0201030","0101"},//抵押-商品房（办公用）
										{"AA","0203020","0101"},//抵押-国有出让土地使用权
										{"A","0202010","0102"},//抵押-标准厂房（开发区内）
										{"A","0203010","0102"},//抵押-国有划拨土地使用权
										{"A","0201010","0102"},//抵押-商品房（商用）
										{"A","0201030","0102"},//抵押-商品房（办公用）
										{"A","0203020","0102"},//抵押-国有出让土地使用权
										{"BBB","0202010","0102"},//抵押-标准厂房（开发区内）
										{"BBB","0203010","0102"},//抵押-国有划拨土地使用权
										{"BBB","0201010","0102"},//抵押-商品房（商用）
										{"BBB","0201030","0102"},//抵押-商品房（办公用）
										{"BBB","0203020","0102"},//抵押-国有出让土地使用权
										{"BB","0202010","0201"},//抵押-标准厂房（开发区内）
										{"BB","0203010","0201"},//抵押-国有划拨土地使用权
										{"BB","0201010","0201"},//抵押-商品房（商用）
										{"BB","0201030","0201"},//抵押-商品房（办公用）
										{"BB","0203020","0201"},//抵押-国有出让土地使用权
										{"B","0202010","0202"},//抵押-标准厂房（开发区内）
										{"B","0203010","0202"},//抵押-国有划拨土地使用权
										{"B","0201010","0202"},//抵押-商品房（商用）
										{"B","0201030","0202"},//抵押-商品房（办公用）
										{"B","0203020","0202"},//抵押-国有出让土地使用权
										{"","0202010","0102"},//抵押-标准厂房（开发区内）
										{"","0203010","0102"},//抵押-国有划拨土地使用权
										{"","0201010","0102"},//抵押-商品房（商用）
										{"","0201030","0102"},//抵押-商品房（办公用）
										{"","0203020","0102"},//抵押-国有出让土地使用权
										
										{"AAA","0202020","0101"},//抵押-一般厂房
										{"AA","0202020","0101"},//抵押-一般厂房
										{"A","0202020","0102"},//抵押-一般厂房
										{"BBB","0202020","0103"},//抵押-一般厂房
										{"BB","0202020","0201"},//抵押-一般厂房
										{"B","0202020","0202"},//抵押-一般厂房
										{"","0202020","0103"},//抵押-一般厂房
										
										{"AAA","0204010","0101"},//抵押-通用设备
										{"AAA","02050","0101"},//交通运输工具抵押（车、船、飞机）
										{"AAA","0202030","0101"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"AA","0204010","0101"},//抵押-通用设备
										{"AA","02050","0101"},//交通运输工具抵押（车、船、飞机）
										{"AA","0202030","0101"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"A","0204010","0102"},//抵押-通用设备
										{"A","02050","0102"},//交通运输工具抵押（车、船、飞机）
										{"A","0202030","0102"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"BBB","0204010","0103"},//抵押-通用设备
										{"BBB","02050","0103"},//交通运输工具抵押（车、船、飞机）
										{"BBB","0202030","0103"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"BB","0204010","0202"},//抵押-通用设备
										{"BB","02050","0202"},//交通运输工具抵押（车、船、飞机）
										{"BB","0202030","0202"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"B","0204010","0203"},//抵押-通用设备
										{"B","02050","0203"},//交通运输工具抵押（车、船、飞机）
										{"B","0202030","0203"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										{"","0204010","0103"},//抵押-通用设备
										{"","02050","0103"},//交通运输工具抵押（车、船、飞机）
										{"","0202030","0103"},//抵押-一般厂房（集体工业地，产权归集体企业所有）
										
										{"AAA","0204020","0101"},//抵押-其他设备
										{"AAA","02060","0101"},//其他抵押
										{"AA","0204020","0101"},//抵押-其他设备
										{"AA","02060","0101"},//其他抵押
										{"A","0204020","0102"},//抵押-其他设备
										{"A","02060","0102"},//其他抵押
										{"BBB","0204020","0201"},//抵押-其他设备
										{"BBB","02060","0201"},//其他抵押
										{"BB","0204020","0202"},//抵押-其他设备
										{"BB","02060","0202"},//其他抵押
										{"B","0204020","0203"},//抵押-其他设备
										{"B","02060","0203"},//其他抵押
										{"","0204020","0201"},//抵押-其他设备
										{"","02060","0201"},//其他抵押
										
										{"AAA","0401010","0101"},//质押-我行人民币存单
										{"AAA","0401020","0101"},//质押-我行外币存单
										{"AAA","0402010","0101"},//质押-中央政府债券
										{"AAA","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"AAA","0402030","0101"},//质押-非银行金融机构债券
										{"AAA","0402040","0101"},//质押-国家或银行担保的企业债券
										{"AAA","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"AAA","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"AAA","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"AA","0401010","0101"},//质押-我行人民币存单
										{"AA","0401020","0101"},//质押-我行外币存单
										{"AA","0402010","0101"},//质押-中央政府债券
										{"AA","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"AA","0402030","0101"},//质押-非银行金融机构债券
										{"AA","0402040","0101"},//质押-国家或银行担保的企业债券
										{"AA","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"AA","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"AA","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"A","0401010","0101"},//质押-我行人民币存单
										{"A","0401020","0101"},//质押-我行外币存单
										{"A","0402010","0101"},//质押-中央政府债券
										{"A","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"A","0402030","0101"},//质押-非银行金融机构债券
										{"A","0402040","0101"},//质押-国家或银行担保的企业债券
										{"A","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"A","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"A","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"BBB","0401010","0101"},//质押-我行人民币存单
										{"BBB","0401020","0101"},//质押-我行外币存单
										{"BBB","0402010","0101"},//质押-中央政府债券
										{"BBB","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"BBB","0402030","0101"},//质押-非银行金融机构债券
										{"BBB","0402040","0101"},//质押-国家或银行担保的企业债券
										{"BBB","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"BBB","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"BBB","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"BB","0401010","0101"},//质押-我行人民币存单
										{"BB","0401020","0101"},//质押-我行外币存单
										{"BB","0402010","0101"},//质押-中央政府债券
										{"BB","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"BB","0402030","0101"},//质押-非银行金融机构债券
										{"BB","0402040","0101"},//质押-国家或银行担保的企业债券
										{"BB","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"BB","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"BB","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"B","0401010","0102"},//质押-我行人民币存单
										{"B","0401020","0102"},//质押-我行外币存单
										{"B","0402010","0102"},//质押-中央政府债券
										{"B","0402020","0102"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"B","0402030","0102"},//质押-非银行金融机构债券
										{"B","0402040","0102"},//质押-国家或银行担保的企业债券
										{"B","0402050","0102"},//质押-非银行金融机构担保的企业债券
										{"B","0404010","0102"},//质押-银行承兑汇票（有授信额度的）
										{"B","0404030","0102"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										{"","0401010","0101"},//质押-我行人民币存单
										{"","0401020","0101"},//质押-我行外币存单
										{"","0402010","0101"},//质押-中央政府债券
										{"","0402020","0101"},//质押-中、农、工、建、交、国家政策性银行、全国股份制银行债券
										{"","0402030","0101"},//质押-非银行金融机构债券
										{"","0402040","0101"},//质押-国家或银行担保的企业债券
										{"","0402050","0101"},//质押-非银行金融机构担保的企业债券
										{"","0404010","0101"},//质押-银行承兑汇票（有授信额度的）
										{"","0404030","0101"},//质押-银行承兑汇票贴现及转贴现（有授信额度的）
										
										{"AAA","0402060","0101"},//质押-企业债券
										{"AAA","0403010","0101"},//质押-上市公司流通股
										{"AAA","0403020","0101"},//质押-上市公司法人股
										{"AAA","0403030","0101"},//质押-股份制商业银行股权
										{"AAA","0404040","0101"},//质押-保单
										{"AAA","0405010","0101"},//质押-商品交易所标准仓单
										{"AAA","0406040","0101"},//质押-有价证券
										{"AA","0402060","0101"},//质押-企业债券
										{"AA","0403010","0101"},//质押-上市公司流通股
										{"AA","0403020","0101"},//质押-上市公司法人股
										{"AA","0403030","0101"},//质押-股份制商业银行股权
										{"AA","0404040","0101"},//质押-保单
										{"AA","0405010","0101"},//质押-商品交易所标准仓单
										{"AA","0406040","0101"},//质押-有价证券
										{"A","0402060","0101"},//质押-企业债券
										{"A","0403010","0101"},//质押-上市公司流通股
										{"A","0403020","0101"},//质押-上市公司法人股
										{"A","0403030","0101"},//质押-股份制商业银行股权
										{"A","0404040","0101"},//质押-保单
										{"A","0405010","0101"},//质押-商品交易所标准仓单
										{"A","0406040","0101"},//质押-有价证券
										{"BBB","0402060","0102"},//质押-企业债券
										{"BBB","0403010","0102"},//质押-上市公司流通股
										{"BBB","0403020","0102"},//质押-上市公司法人股
										{"BBB","0403030","0102"},//质押-股份制商业银行股权
										{"BBB","0404040","0102"},//质押-保单
										{"BBB","0405010","0102"},//质押-商品交易所标准仓单
										{"BBB","0406040","0102"},//质押-有价证券
										{"BB","0402060","0103"},//质押-企业债券
										{"BB","0403010","0103"},//质押-上市公司流通股
										{"BB","0403020","0103"},//质押-上市公司法人股
										{"BB","0403030","0103"},//质押-股份制商业银行股权
										{"BB","0404040","0103"},//质押-保单
										{"BB","0405010","0103"},//质押-商品交易所标准仓单
										{"BB","0406040","0103"},//质押-有价证券
										{"B","0402060","0103"},//质押-企业债券
										{"B","0403010","0103"},//质押-上市公司流通股
										{"B","0403020","0103"},//质押-上市公司法人股
										{"B","0403030","0103"},//质押-股份制商业银行股权
										{"B","0404040","0103"},//质押-保单
										{"B","0405010","0103"},//质押-商品交易所标准仓单
										{"B","0406040","0103"},//质押-有价证券
										{"","0402060","0102"},//质押-企业债券
										{"","0403010","0102"},//质押-上市公司流通股
										{"","0403020","0102"},//质押-上市公司法人股
										{"","0403030","0102"},//质押-股份制商业银行股权
										{"","0404040","0102"},//质押-保单
										{"","0405010","0102"},//质押-商品交易所标准仓单
										{"","0406040","0102"},//质押-有价证券
										
										{"AAA","0403040","0101"},//质押-非银行金融机构股权
										{"AAA","0403050","0101"},//质押-其他金融机构股权
										{"AAA","0405020","0101"},//质押-我行认可的非标准仓单
										{"AAA","0405030","0101"},//质押-提单（唯一提货凭证）
										{"AAA","0405040","0101"},//质押-汽车合格证
										{"AA","0403040","0101"},//质押-非银行金融机构股权
										{"AA","0403050","0101"},//质押-其他金融机构股权
										{"AA","0405020","0101"},//质押-我行认可的非标准仓单
										{"AA","0405030","0101"},//质押-提单（唯一提货凭证）
										{"AA","0405040","0101"},//质押-汽车合格证
										{"A","0403040","0102"},//质押-非银行金融机构股权
										{"A","0403050","0102"},//质押-其他金融机构股权
										{"A","0405020","0102"},//质押-我行认可的非标准仓单
										{"A","0405030","0102"},//质押-提单（唯一提货凭证）
										{"A","0405040","0102"},//质押-汽车合格证
										{"BBB","0403040","0102"},//质押-非银行金融机构股权
										{"BBB","0403050","0102"},//质押-其他金融机构股权
										{"BBB","0405020","0102"},//质押-我行认可的非标准仓单
										{"BBB","0405030","0102"},//质押-提单（唯一提货凭证）
										{"BBB","0405040","0102"},//质押-汽车合格证
										{"BB","0403040","0103"},//质押-非银行金融机构股权
										{"BB","0403050","0103"},//质押-其他金融机构股权
										{"BB","0405020","0103"},//质押-我行认可的非标准仓单
										{"BB","0405030","0103"},//质押-提单（唯一提货凭证）
										{"BB","0405040","0103"},//质押-汽车合格证
										{"B","0403040","0103"},//质押-非银行金融机构股权
										{"B","0403050","0103"},//质押-其他金融机构股权
										{"B","0405020","0103"},//质押-我行认可的非标准仓单
										{"B","0405030","0103"},//质押-提单（唯一提货凭证）
										{"B","0405040","0103"},//质押-汽车合格证
										{"","0403040","0102"},//质押-非银行金融机构股权
										{"","0403050","0102"},//质押-其他金融机构股权
										{"","0405020","0102"},//质押-我行认可的非标准仓单
										{"","0405030","0102"},//质押-提单（唯一提货凭证）
										{"","0405040","0102"},//质押-汽车合格证
										
										{"AAA","0403060","0101"},//质押-其他股权
										{"AAA","0404050","0101"},//质押-其他可转让票据
										{"AAA","0406010","0101"},//质押-有价的可转让的权利
										{"AAA","0406020","0101"},//质押-道路收费权
										{"AAA","0406030","0101"},//质押-应收账款
										{"AAA","04070","0101"},//质押-有价的可转让权利
										{"AAA","04080","0101"},//质押-其他
										{"AAA","0404020","0101"},//质押-商业承兑汇票
										{"AA","0403060","0101"},//质押-其他股权
										{"AA","0404050","0101"},//质押-其他可转让票据
										{"AA","0406010","0101"},//质押-有价的可转让的权利
										{"AA","0406020","0101"},//质押-道路收费权
										{"AA","0406030","0101"},//质押-应收账款
										{"AA","04070","0101"},//质押-有价的可转让权利
										{"AA","04080","0101"},//质押-其他
										{"AA","0404020","0101"},//质押-商业承兑汇票
										{"A","0403060","0102"},//质押-其他股权
										{"A","0404050","0102"},//质押-其他可转让票据
										{"A","0406010","0102"},//质押-有价的可转让的权利
										{"A","0406020","0102"},//质押-道路收费权
										{"A","0406030","0102"},//质押-应收账款
										{"A","04070","0102"},//质押-有价的可转让权利
										{"A","04080","0102"},//质押-其他
										{"A","0404020","0102"},//质押-商业承兑汇票
										{"BBB","0403060","0103"},//质押-其他股权
										{"BBB","0404050","0103"},//质押-其他可转让票据
										{"BBB","0406010","0103"},//质押-有价的可转让的权利
										{"BBB","0406020","0103"},//质押-道路收费权
										{"BBB","0406030","0103"},//质押-应收账款
										{"BBB","04070","0103"},//质押-有价的可转让权利
										{"BBB","04080","0103"},//质押-其他
										{"BBB","0404020","0103"},//质押-商业承兑汇票
										{"BB","0403060","0103"},//质押-其他股权
										{"BB","0404050","0103"},//质押-其他可转让票据
										{"BB","0406010","0103"},//质押-有价的可转让的权利
										{"BB","0406020","0103"},//质押-道路收费权
										{"BB","0406030","0103"},//质押-应收账款
										{"BB","04070","0103"},//质押-有价的可转让权利
										{"BB","04080","0103"},//质押-其他
										{"BB","0404020","0103"},//质押-商业承兑汇票
										{"B","0403060","0103"},//质押-其他股权
										{"B","0404050","0103"},//质押-其他可转让票据
										{"B","0406010","0103"},//质押-有价的可转让的权利
										{"B","0406020","0103"},//质押-道路收费权
										{"B","0406030","0103"},//质押-应收账款
										{"B","04070","0103"},//质押-有价的可转让权利
										{"B","04080","0103"},//质押-其他
										{"B","0404020","0103"},//质押-商业承兑汇票
										{"","0403060","0103"},//质押-其他股权
										{"","0404050","0103"},//质押-其他可转让票据
										{"","0406010","0103"},//质押-有价的可转让的权利
										{"","0406020","0103"},//质押-道路收费权
										{"","0406030","0103"},//质押-应收账款
										{"","04070","0103"},//质押-有价的可转让权利
										{"","04080","0103"},//质押-其他
										{"","0404020","0103"},//质押-商业承兑汇票
										};	
	//农户贷款逾期天数、主担保方式分类矩阵
	public static final String[][] M10 ={{"005","0","01"},//信用
										{"005","30","02"},//信用
										{"005","60","03"},//信用
										{"005","180","04"},//信用
										{"005","360","04"},//信用
										{"005","999","05"},//信用
										{"010","0","01"},//担保
										{"010","30","02"},//担保
										{"010","60","03"},//担保
										{"010","180","03"},//担保
										{"010","360","04"},//担保
										{"010","999","05"},//担保
										{"020","0","01"},//抵押
										{"020","30","02"},//抵押
										{"020","60","02"},//抵押
										{"020","180","03"},//抵押
										{"020","360","04"},//抵押
										{"020","999","05"},//抵押
										{"040","0","01"},//质押
										{"040","30","01"},//质押
										{"040","60","02"},//质押
										{"040","180","03"},//质押
										{"040","360","04"},//质押
										{"040","999","05"},//质押
										};
	//其它自然人贷款逾期天数、主担保方式分类矩阵
	public static final String[][] M11 ={{"005","0","01"},//信用
										{"005","30","02"},//信用
										{"005","90","03"},//信用
										{"005","180","04"},//信用
										{"005","360","04"},//信用
										{"005","540","05"},//信用
										{"005","999","05"},//信用
										{"010","0","01"},//担保
										{"010","30","02"},//担保
										{"010","90","02"},//担保
										{"010","180","03"},//担保
										{"010","360","04"},//担保
										{"010","540","05"},//担保
										{"010","999","05"},//担保
										{"020","0","01"},//抵押
										{"020","30","02"},//抵押
										{"020","90","02"},//抵押
										{"020","180","03"},//抵押
										{"020","360","04"},//抵押
										{"020","540","04"},//抵押
										{"020","999","05"},//抵押
										{"040","0","01"},//质押
										{"040","30","01"},//质押
										{"040","90","02"},//质押
										{"040","180","03"},//质押
										{"040","360","04"},//质押
										{"040","540","04"},//质押
										{"040","999","05"},//质押
										};

	/**
	 * 根据逾期天数矩阵形成风险分类结果
	 * @param overdueDays
	 * @param vouchType
	 * @return classifyResult
	 */
	public static String ClassifyModelWithOverDueDays(int overdueDays,String[][] M){
		String classifyResult = "";
		int overdueDaysofModel = 0;	
		for(int i=0;i<M.length;i++){
			try{
				overdueDaysofModel = Integer.parseInt(M[i][0]);
			}catch(NumberFormatException ex){
				System.out.println("模型中逾期日期部分配置存在问题！");
			}
			if(overdueDays<=overdueDaysofModel || overdueDaysofModel>=999){
				classifyResult = M[i][1];
				break;
			}
		}
		return classifyResult;
	}
	/**
	 * 根据信用等级矩阵形成风险分类结果
	 * @param creditLevel
	 * @param vouchType
	 * @return classifyResult
	 */
	public static String ClassifyModelWithCreditLevel(String creditLevel,String[][] M){
		String classifyResult = "";
		if(creditLevel == null) creditLevel = "";
		String creditLevelofModel = "";	
		for(int i=0;i<M.length;i++){
			creditLevelofModel = M[i][0];
			if(creditLevel.equals(creditLevelofModel)){
				classifyResult = M[i][1];
				break;
			}
		}
		return classifyResult;
	}
	/**
	 * 根据信用等级、担保方式矩阵形成风险分类结果
	 * @param creditLevel
	 * @param vouchType
	 * @return classifyResult
	 */
	public static String ClassifyModelWithCreditLevelVouchType(String creditLevel,String vouchType,String[][] M){
		String classifyResult = "";
		if(creditLevel == null) creditLevel = "";
		if(vouchType == null) vouchType = "";
		String creditLevelofModel = "";	
		String vouchTypeofModel = "";
		for(int i=0;i<M.length;i++){
			creditLevelofModel = M[i][0];
			vouchTypeofModel = M[i][1];
			if(creditLevel.equals(creditLevelofModel)&&vouchType.equals(vouchTypeofModel)){
				classifyResult = M[i][2];
				break;
			}
		}
		return classifyResult;
	}
	/**
	 * 根据担保方式、逾期天数矩阵形成风险分类结果
	 * @param creditLevel
	 * @param vouchType
	 * @return classifyResult
	 */
	public static String ClassifyModelWithVouchTypeOverdueDays(String vouchType,int overdueDays,String[][] M){
		String classifyResult = "";
		if(vouchType == null) vouchType = "";
		int overdueDaysofModel = 0;	
		String vouchTypeofModel = "";
		for(int i=0;i<M.length;i++){
			vouchTypeofModel = M[i][0];
			try{
				overdueDaysofModel = Integer.parseInt(M[i][1]);
			}catch(NumberFormatException ex){
				System.out.println("模型中逾期日期部分配置存在问题！");
			}
			
			if(vouchType.equals(vouchTypeofModel)&&(overdueDays <= overdueDaysofModel || overdueDaysofModel>=999)){
				classifyResult = M[i][2];
				break;
			}
		}
		return classifyResult;
	}

	/**
	 * 调试主程序
	 * @param args
	 */
	public static void main(String[] args){
//		System.out.println(ClassifyModelWithOverDueDays(91,M1));
//		System.out.println(ClassifyModel.ClassifyModelWithVouchTypeOverdueDays("020",91,M2));
//		System.out.println(ClassifyModel.ClassifyModelWithOverDueDays(100000, ClassifyModel.M5));
//		System.out.println(ClassifyModel.ClassifyModelWithOverDueDays(181, ClassifyModel.M6));
//		System.out.println(ClassifyModel.ClassifyModelWithCreditLevelVouchType("B","0401010",ClassifyModel.M9));
//		System.out.println(ClassifyModelWithCreditLevel("BB",M9));
		//System.out.println(ClassifyModelWithCreditLevelVouchType("BBB","0103010",M9));
		//System.out.println(ClassifyModelWithVouchTypeOverdueDays("010",89,M10));
	}
}
